In [1]:
import pandas as pd

In [2]:
import os
root_dir1 = r'C:\Users\milan\Desktop\CDIS Project\AEML\HT_Cable\Data (from AEML)'
root_dir2 = r'C:\Users\milan\Desktop\CDIS Project\AEML\HT_Cable\Data (from me)'

### Loading Fault Report

In [3]:
fault_report_df = pd.read_excel(os.path.join(root_dir1,'Fault Report 3 month.xlsx'))
fault_report_df = fault_report_df.drop_duplicates(subset='EVENT_TIME', keep='first').reset_index(drop=True)
fault_report_df = fault_report_df[['VOLTAGE','FROM SWITCH', 'TO SWITCH']]
fault_report_df

    VOLTAGE FROM SWITCH  TO SWITCH
0     11 KV       39949     7869.0
1     11 KV       30632    43054.0
2     11 KV       31943    25766.0
3     11 KV        4269     4682.0
4     11 KV        7430    11675.0
..      ...         ...        ...
212   11 KV       39272     1534.0
213   11 KV        3104     6857.0
214   11 KV       16641    17241.0
215   11 KV       18417    13092.0
216   11 KV       41053     2214.0

[217 rows x 3 columns]

In [4]:
fault_report11KV_df = fault_report_df[fault_report_df['VOLTAGE'] == '11 KV'].reset_index(drop=True)
fault_report11KV_df

    VOLTAGE FROM SWITCH  TO SWITCH
0     11 KV       39949     7869.0
1     11 KV       30632    43054.0
2     11 KV       31943    25766.0
3     11 KV        4269     4682.0
4     11 KV        7430    11675.0
..      ...         ...        ...
188   11 KV       39272     1534.0
189   11 KV        3104     6857.0
190   11 KV       16641    17241.0
191   11 KV       18417    13092.0
192   11 KV       41053     2214.0

[193 rows x 3 columns]

In [5]:
fault_report22_33KV_df = fault_report_df[fault_report_df['VOLTAGE'] != '11 KV'].reset_index(drop=True)
fault_report22_33KV_df

   VOLTAGE    FROM SWITCH  TO SWITCH
0    22 KV    T22CHMBOG03     1151.0
1    22 KV     T22SAKOG09    33063.0
2    33 KV       220GOR32    33160.0
3    33 KV       220GOI18    33172.0
4    33 KV       220AAR41    33207.0
5    33 KV       220AAR90    33163.0
6    33 KV   T33DHAOG5H08    33248.0
7    22 KV  T22DHAOG07H09    33154.0
8    33 KV   T33DHAOG6H08    33325.0
9    33 KV   T33DHAOG9H24    33236.0
10   22 KV  T22DHAOG07H09    33154.0
11   33 KV       220GHO47    33176.0
12   33 KV   T33DHAOG9H24    33236.0
13   22 KV          33054    33012.0
14   33 KV       220GHO61    33059.0
15   22 KV       220AAR41    33207.0
16   33 KV       220SAK32    33056.0
17   22 KV    T33CHMBOG03     1151.0
18   22 KV     T22SAKOG10     1289.0
19   33 KV  T33DHAOG11H20    33128.0
20   33 KV       220VER63    33294.0
21   33 KV       220AAR58    33353.0
22     NaN  T22SHROG11H31    33348.0
23   22 KV           1135     1102.0

### Loading Logsheet

In [6]:
logsheet11KV_df = pd.read_excel(os.path.join(root_dir1,'Updated Logsheet Report_3 months.xlsx'),sheet_name='11KV')
logsheet11KV_df = logsheet11KV_df[['VOLTAGE_LEVEL', 'TO_SWITCH', 'FROM_SWITCH']]
logsheet11KV_df.rename(columns={'VOLTAGE_LEVEL':'VOLTAGE', 'TO_SWITCH': 'TO SWITCH','FROM_SWITCH': 'FROM SWITCH'}, inplace= True)
logsheet11KV_df

     VOLTAGE  TO SWITCH  FROM SWITCH
0         11      13154        35884
1         11      12674        31072
2         11      15393        15444
3         11       9301        17080
4         11      35080        30126
..       ...        ...          ...
289       11      32732        29037
290       11      31608         7861
291       11      38339        37814
292       11      39936        12262
293       11      14887        12043

[294 rows x 3 columns]

In [7]:
logsheet22_33KV_df = pd.read_excel(os.path.join(root_dir1,'Updated Logsheet Report_3 months.xlsx'),sheet_name='22_33KV')
logsheet22_33KV_df = logsheet22_33KV_df[['VOLTAGE_LEVEL', 'TO_SWITCH']]
logsheet22_33KV_df.rename(columns={'VOLTAGE_LEVEL':'VOLTAGE', 'TO_SWITCH': 'TO SWITCH'}, inplace= True)
logsheet22_33KV_df

    VOLTAGE  TO SWITCH
0        33      33138
1        33      33176
2        22      33209
3        22       1151
4        33      33074
5        22      33063
6        33      33248
7        33      33236
8        33      33353
9        33      33329
10       33      33099
11       33      33056
12       33      33059
13       33      33059
14       22      33154
15       33      33128
16       33      33207
17       33      33207
18       22      33054
19       22      33069
20       33      11540
21       22      33154
22       33      33222
23       22       1102
24       33      33236
25       33      33230
26       33      33160
27       33      33294
28       22       1151
29       33      33353
30       22       1289
31       33      33348
32       33      33325

### Checking if switches in one file are also present in another

In [9]:
inFaultNotInLog_11KV = set(fault_report11KV_df['FROM SWITCH'].dropna().astype(int)) - set(logsheet11KV_df['FROM SWITCH'].dropna().astype(int))
inLogNotInFault_11KV = set(logsheet11KV_df['FROM SWITCH'].dropna().astype(int)) - set(fault_report11KV_df['FROM SWITCH'].dropna().astype(int))
inBoth_11KV = set(logsheet11KV_df['FROM SWITCH'].dropna().astype(int)) & set(fault_report11KV_df['FROM SWITCH'].dropna().astype(int))

inFaultNotInLog_22_33KV = set(fault_report22_33KV_df['TO SWITCH'].dropna().astype(int)) - set(logsheet22_33KV_df['TO SWITCH'].dropna().astype(int)) 
inLogNotInFault_22_33KV = set(logsheet22_33KV_df['TO SWITCH'].dropna().astype(int)) - set(fault_report22_33KV_df['TO SWITCH'].dropna().astype(int)) 
inBoth_22_33KV = set(logsheet22_33KV_df['TO SWITCH'].dropna().astype(int)) & set(fault_report22_33KV_df['TO SWITCH'].dropna().astype(int))

print("Number of switches that are in Fault Report but not in Log sheet for 11KV is: ", len(inFaultNotInLog_11KV))
print("Number of switches that are in Log Sheet but not in Fault Report for 11KV is: ", len(inLogNotInFault_11KV))
print("Number of switches that are in both Log Sheet and Fault Report for 11KV is: ", len(inBoth_11KV))
print()
print("Number of switches that are in Fault Report but not in Log sheet for 22KV, 33KV is: ", len(inFaultNotInLog_22_33KV))
print("Number of switches that are in Log Sheet but not in Fault Report for 22KV, 33KV is: ", len(inLogNotInFault_22_33KV))
print("Number of switches that are in both Log Sheet and Fault Report for 22, 33KV is: ", len(inBoth_22_33KV))

Number of switches that are in Fault Report but not in Log sheet for 11KV is:  20
Number of switches that are in Log Sheet but not in Fault Report for 11KV is:  114
Number of switches that are in both Log Sheet and Fault Report for 11KV is:  158

Number of switches that are in Fault Report but not in Log sheet for 22KV, 33KV is:  3
Number of switches that are in Log Sheet but not in Fault Report for 22KV, 33KV is:  10
Number of switches that are in both Log Sheet and Fault Report for 22, 33KV is:  17

In [11]:
def write_txt (file_name, data):
    with open(file_name+'.txt', 'w') as file:
        for item in data:
            file.write(str(item) + '\n')

In [13]:
write_txt('inFaultNotInLog_11KV',inFaultNotInLog_11KV)
write_txt('inLogNotInFault_11KV',inLogNotInFault_11KV)
write_txt('inBoth_11KV',inBoth_11KV)
write_txt('inFaultNotInLog_22_33KV',inFaultNotInLog_22_33KV)
write_txt('inLogNotInFault_22_33KV',inLogNotInFault_22_33KV)
write_txt('inBoth_22_33KV',inBoth_22_33KV)

In [10]:
len(fault_report11KV_df['FROM SWITCH'].unique()), len(logsheet11KV_df['FROM SWITCH'].unique())

(179, 272)

In [11]:
len(fault_report22_33KV_df['TO SWITCH'].unique()), len(logsheet22_33KV_df['TO SWITCH'].unique())

(20, 27)

### Loading Scada Data

In [12]:
scada_data_df = pd.read_excel(os.path.join(root_dir2,'Scada Data','Scada_Analysis-I.xlsx'))
scada_data_df = scada_data_df[['SWNO', 'VOLTAGE']]
scada_data_df

       SWNO VOLTAGE
0       104    11KV
1       105    11KV
2       106    11KV
3       108    11KV
4       109    11KV
...     ...     ...
2012  42782    11KV
2013  42783    11KV
2014  42784    11KV
2015  42785    11KV
2016  42786    11KV

[2017 rows x 2 columns]

In [13]:
scada_data_11kv_df = scada_data_df[scada_data_df['VOLTAGE'] == '11KV'].reset_index(drop=True)
scada_data_11kv_df

       SWNO VOLTAGE
0       104    11KV
1       105    11KV
2       106    11KV
3       108    11KV
4       109    11KV
...     ...     ...
1722  42782    11KV
1723  42783    11KV
1724  42784    11KV
1725  42785    11KV
1726  42786    11KV

[1727 rows x 2 columns]

In [14]:
scada_data_22_33kv_df = scada_data_df[scada_data_df['VOLTAGE'] != '11KV'].reset_index(drop=True)
scada_data_22_33kv_df

      SWNO VOLTAGE
0     1102    22KV
1     1103    22KV
2     1128    22KV
3     1129    22KV
4     1133    22KV
..     ...     ...
285  33393    33KV
286  33394    33KV
287  33395    33KV
288  33396    22KV
289  33409    22KV

[290 rows x 2 columns]

In [16]:
inFaultNotInScada_11KV = set(fault_report11KV_df['FROM SWITCH'].dropna().astype(int)) - set(scada_data_11kv_df['SWNO'].dropna().astype(int))
inLogNotInScada_11KV = set(logsheet11KV_df['FROM SWITCH'].dropna().astype(int)) - set(scada_data_11kv_df['SWNO'].dropna().astype(int))
inBothLogAndScada_11KV = set(logsheet11KV_df['FROM SWITCH'].dropna().astype(int)) & set(scada_data_11kv_df['SWNO'].dropna().astype(int))

inFaultNotInScada_22_33KV = set(fault_report22_33KV_df['TO SWITCH'].dropna().astype(int)) - set(scada_data_22_33kv_df['SWNO'].dropna().astype(int))
inLogNotInScada_22_33KV = set(logsheet22_33KV_df['TO SWITCH'].dropna().astype(int)) - set(scada_data_22_33kv_df['SWNO'].dropna().astype(int))
inBothLogAndScada_22_33KV = set(logsheet22_33KV_df['TO SWITCH'].dropna().astype(int)) & set(scada_data_22_33kv_df['SWNO'].dropna().astype(int))

print("Number of switches that are in Fault Report but not in Scada for 11KV is: ", len(inFaultNotInScada_11KV))
print("Number of switches that are in Log Sheet but not in Scada for 11KV is: ", len(inLogNotInScada_11KV))
print("Number of switches that are in both Log Sheet and Scada for 11KV is: ", len(inBothLogAndScada_11KV))
print()
print("Number of switches that are in Fault Report but not in Scada for 22KV, 33KV is: ", len(inFaultNotInScada_22_33KV))
print("Number of switches that are in Log Sheet but not in Scada for 22KV, 33KV is: ", len(inLogNotInScada_22_33KV))
print("Number of switches that are in both Log Sheet and Scada for 22KV, 33KV is: ", len(inBothLogAndScada_22_33KV))

Number of switches that are in Fault Report but not in Scada for 11KV is:  152
Number of switches that are in Log Sheet but not in Scada for 11KV is:  237
Number of switches that are in both Log Sheet and Scada for 11KV is:  35

Number of switches that are in Fault Report but not in Scada for 22KV, 33KV is:  1
Number of switches that are in Log Sheet but not in Scada for 22KV, 33KV is:  2
Number of switches that are in both Log Sheet and Scada for 22KV, 33KV is:  25

In [25]:
write_txt('inFaultNotInScada_11KV',inFaultNotInScada_11KV)
write_txt('inLogNotInScada_11KV',inLogNotInScada_11KV)
write_txt('inFaultNotInScada_22_33KV',inFaultNotInScada_22_33KV)
write_txt('inLogNotInScada_22_33KV',inLogNotInScada_22_33KV)

In [17]:
len(fault_report11KV_df['FROM SWITCH'].unique()), len(logsheet11KV_df['FROM SWITCH'].unique())

(179, 272)

In [18]:
len(fault_report22_33KV_df['TO SWITCH'].unique()), len(logsheet22_33KV_df['TO SWITCH'].unique())

(20, 27)

In [21]:
inLogNotInScada_22_33KV

{11540, 33160}

In [19]:
inLogNotInScada_11KV

{613,
 1013,
 2679,
 2927,
 4269,
 4365,
 4517,
 4520,
 4889,
 5084,
 5097,
 5501,
 5649,
 6019,
 6078,
 6145,
 6163,
 6235,
 6647,
 6991,
 7142,
 7181,
 7430,
 7501,
 7556,
 7601,
 7648,
 7717,
 7780,
 7861,
 7901,
 7940,
 9106,
 9235,
 9297,
 9312,
 9664,
 9850,
 9953,
 9954,
 10035,
 10284,
 10499,
 10519,
 10547,
 10630,
 10661,
 10909,
 10977,
 10997,
 11365,
 11527,
 11702,
 11965,
 11982,
 12025,
 12043,
 12045,
 12088,
 12172,
 12262,
 12370,
 12561,
 12595,
 12613,
 13140,
 13342,
 13464,
 13504,
 13512,
 13606,
 13770,
 13873,
 13909,
 13928,
 13954,
 14017,
 14217,
 14333,
 14473,
 14606,
 14672,
 14851,
 15229,
 15435,
 15444,
 15464,
 15630,
 15694,
 15892,
 15992,
 16128,
 16142,
 16150,
 16398,
 16512,
 16641,
 16716,
 16729,
 16751,
 16880,
 16997,
 17080,
 17100,
 17143,
 17452,
 17614,
 18122,
 18149,
 18198,
 18417,
 18742,
 18896,
 18982,
 19129,
 19147,
 19155,
 19418,
 19592,
 19605,
 19693,
 19699,
 19747,
 19748,
 19758,
 19770,
 19824,
 25059,
 25774,
 25915,
 25978,
 26056,
 26120,
 26624,
 26990,
 27004,
 28017,
 28084,
 28393,
 28524,
 29037,
 29063,
 29238,
 29405,
 29875,
 29949,
 30126,
 30281,
 30558,
 30632,
 30648,
 30745,
 30975,
 31051,
 31072,
 31483,
 31517,
 31529,
 31611,
 31723,
 31943,
 31961,
 31965,
 32174,
 32295,
 32476,
 32830,
 34270,
 34318,
 34405,
 34772,
 34782,
 34813,
 34884,
 34921,
 34964,
 35197,
 35344,
 35530,
 35677,
 35936,
 35964,
 36137,
 36158,
 36346,
 36595,
 36802,
 36806,
 37095,
 37510,
 37538,
 37544,
 37618,
 37789,
 37814,
 37911,
 37929,
 37944,
 38350,
 38465,
 38520,
 38542,
 38696,
 38768,
 38856,
 38910,
 39045,
 39111,
 39272,
 39323,
 39393,
 39754,
 39925,
 39949,
 39999,
 40114,
 40468,
 40767,
 40770,
 40782,
 40982,
 41053,
 41199,
 41680,
 41739,
 41814,
 42086,
 42432,
 42632,
 42705,
 42737,
 42764,
 42837,
 42918,
 43020,
 43144,
 43191}

In [20]:
inBothLogAndScada_11KV

{1331,
 3104,
 4992,
 7832,
 7834,
 9256,
 11763,
 15506,
 18444,
 18638,
 18828,
 25356,
 26032,
 26206,
 26373,
 28483,
 28484,
 28490,
 29559,
 30476,
 30482,
 31266,
 31276,
 32165,
 32561,
 34557,
 35366,
 35372,
 35874,
 35884,
 40721,
 41717,
 41856,
 41910,
 42303}